
read_verilog my_design.v
hierarchy -check -top my_design


write_json -aig my_design_start.json
# show -pause

proc; opt;
write_json -aig my_design_proc.json
# show -pause

memory; opt;
write_json -aig my_design_memory.json
# show

aigmap; opt;   # Why does turning this on cause the simulation to not work anymore?
techmap; opt;
show # For large designs, the show command never completes.
# TODO: Look into selecting a part of the design instead of the entire thing.

# write_json -aig my_design.json
write_json my_design.json
